% 绘制目标函数曲线
function draw_picture(xmin,xmax,ymin,ymax)
%   xmin    %X轴的最小值
%   xmax    %X轴的最大值
%   ymin    %y轴的最小值
%   ymax    %y轴的最大值

figure
[x,y] = meshgrid(xmin:0.1:xmax,ymin:0.1:ymax);
%需要把这个函数替换为自己的函数
%z = x.^2 + y.^2 - 10*cos(2*pi*x) - 10*cos(2*pi*y) + 20;
p1=3101.48106558;
p2=-2273.88806607482;
p3=654.670397221758;
p4=-92.81658866522;
p5=6.4944116852448;
p6=-0.179713578765559;
p7=2.84195564548629;
p8=-3.19190193572636;
p9=1.53535283889718;
p10=-0.327308155341518;
p11=0.0254764037950851;
z = p1+p2*x+p3*x.^2+p4*x.^3+p5*x.^4+p6*x.^5+p7*y+p8*y.^2+p9*y.^3+p10*y.^4+p11*y.^5;

mesh(x,y,z);
xlabel('X轴');
ylabel('Y轴');
zlabel('Z轴（耦合协调度）');
hold on